<a href="https://colab.research.google.com/github/nastyaivt/MO/blob/main/Lab01.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Лабораторная работа №1
## Анализ пассажиров корабля "Титаник"

**Заполните недостающий код ("You code here")**

In [1]:
import numpy as np
import pandas as pd
from matplotlib import pyplot as plt
# Graphics in SVG format are more sharp and legible
%config InlineBackend.figure_format = 'svg'
pd.set_option("display.precision", 2)

** Чтение данных в Pandas DataFrame**

In [2]:
data = pd.read_csv('titanic_train.csv',
                  index_col='PassengerId')

**Первые 5 строк**

In [ ]:
data.head(5)

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.25,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.28,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.92,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.10,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.05,NaN,S

In [ ]:
data.describe()

       Survived  Pclass     Age   SibSp   Parch    Fare
count    891.00  891.00  714.00  891.00  891.00  891.00
mean       0.38    2.31   29.70    0.52    0.38   32.20
std        0.49    0.84   14.53    1.10    0.81   49.69
min        0.00    1.00    0.42    0.00    0.00    0.00
25%        0.00    2.00   20.12    0.00    0.00    7.91
50%        0.00    3.00   28.00    0.00    0.00   14.45
75%        1.00    3.00   38.00    1.00    0.00   31.00
max        1.00    3.00   80.00    8.00    6.00  512.33

**Давайте выберем тех пассажиров, которые отправились в Cherbourg (Embarked = C) и заплатили > 200 фунтов за билет (fare > 200).**

Убедитесь, что вы понимаете, как на самом деле работает эта конструкция.

In [ ]:
data[(data['Embarked'] == 'C') & (data.Fare > 200)].head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
119,0,1,"Baxter, Mr. Quigg Edmond",male,24.0,0,1,PC 17558,247.52,B58 B60,C
259,1,1,"Ward, Miss. Anna",female,35.0,0,0,PC 17755,512.33,NaN,C
300,1,1,"Baxter, Mrs. James (Helene DeLaudeniere Chaput)",female,50.0,0,1,PC 17558,247.52,B58 B60,C
312,1,1,"Ryerson, Miss. Emily Borie",female,18.0,2,2,PC 17608,262.38,B57 B59 B63 B66,C
378,0,1,"Widener, Mr. Harry Elkins",male,27.0,0,2,113503,211.50,C82,C

** Мы можем отсортировать этих людей по тарифу (Fare) в порядке убывания. **

In [ ]:
data[(data['Embarked'] == 'C') &
     (data['Fare'] > 200)].sort_values(by='Fare',
                               ascending=False).head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
259,1,1,"Ward, Miss. Anna",female,35.0,0,0,PC 17755,512.33,NaN,C
680,1,1,"Cardeza, Mr. Thomas Drake Martinez",male,36.0,0,1,PC 17755,512.33,B51 B53 B55,C
738,1,1,"Lesurer, Mr. Gustave J",male,35.0,0,0,PC 17755,512.33,B101,C
312,1,1,"Ryerson, Miss. Emily Borie",female,18.0,2,2,PC 17608,262.38,B57 B59 B63 B66,C
743,1,1,"Ryerson, Miss. Susan Parker ""Suzette""",female,21.0,2,2,PC 17608,262.38,B57 B59 B63 B66,C

**Давайте добавим новый признак.**

In [ ]:
def age_category(age):
    '''
    < 30 -> 1
    >= 30, <55 -> 2
    >= 55 -> 3
    '''
    if age < 30:
        return 1
    elif age < 55:
        return 2
    elif age >= 55:
        return 3

In [ ]:
age_categories = [age_category(age) for age in data.Age]
data['Age_category'] = age_categories

**Другой способ сделать это с `apply`.**

In [ ]:
data['Age_category'] = data['Age'].apply(age_category)

**1. Сколько мужчин / женщин было на борту?**
- 412 мужчин и 479 женщин
- 314 мужчин и 577 женщин
- 479 мужчин и 412 женщин
- 577 мужчин и 314 женщин

In [5]:
gender_counts = data['Sex'].value_counts()

print("Количество пассажиров по полу:")
print(f"Мужчины: {gender_counts.get('male', 0)}")
print(f"Женщины: {gender_counts.get('female', 0)}")

Количество пассажиров по полу:
Мужчины: 577
Женщины: 314

**2. Определите распределение функции `Pclass`. Теперь Для мужчин и женщин отдельно. Сколько людей из второго класса было на борту?**
- 104
- 108
- 112
- 125

In [26]:
print("Общее распределение по классам:")
class_distribution = data['Pclass'].value_counts().sort_index()
for pclass, count in class_distribution.items():
    print(f"Класс {pclass}: {count} человек")

print("\nРаспределение по классам для мужчин и женщин:")
gender_class_distribution = data.groupby(['Sex', 'Pclass']).size().unstack(fill_value=0)

print("\nМужчины:")
for pclass in sorted(data['Pclass'].unique()):
    count = gender_class_distribution.loc['male', pclass] if 'male' in gender_class_distribution.index else 0
    print(f"  Класс {pclass}: {count} человек")

print("\nЖенщины:")
for pclass in sorted(data['Pclass'].unique()):
    count = gender_class_distribution.loc['female', pclass] if 'female' in gender_class_distribution.index else 0
    print(f"  Класс {pclass}: {count} человек")

second_class_total = data[data['Pclass'] == 2].shape[0]
print(f"\nВсего людей из второго класса: {second_class_total}")

second_class_gender = data[data['Pclass'] == 2]['Sex'].value_counts()
print(f"Из них:")
print(f"  Мужчин: {second_class_gender.get('male', 0)}")
print(f"  Женщин: {second_class_gender.get('female', 0)}")

Общее распределение по классам:
Класс 1: 216 человек
Класс 2: 184 человек
Класс 3: 491 человек

Распределение по классам для мужчин и женщин:

Мужчины:
  Класс 1: 122 человек
  Класс 2: 108 человек
  Класс 3: 347 человек

Женщины:
  Класс 1: 94 человек
  Класс 2: 76 человек
  Класс 3: 144 человек

Всего людей из второго класса: 184
Из них:
  Мужчин: 108
  Женщин: 76

**3. Каковы медиана и стандартное отклонение`Fare`?. Округлите до 2-х знаков после запятой.**
- медиана 14,45, стандартное отклонение 49,69
- медиана 15,1, стандартное отклонение 12,15
- медиана 13,15, стандартное отклонение 35,3
- Медиана 17,43, стандартное отклонение - 39,1.

In [9]:
median_fare = data['Fare'].median()
std_fare = data['Fare'].std()

median_fare_rounded = round(median_fare, 2)
std_fare_rounded = round(std_fare, 2)

print("Статистика стоимости билетов (Fare):")
print(f"Медиана: {median_fare_rounded}")
print(f"Стандартное отклонение: {std_fare_rounded}")

Статистика стоимости билетов (Fare):
Медиана: 14.45
Стандартное отклонение: 49.69

** 4. Правда ли, что средний возраст выживших людей выше, чем у пассажиров, которые в конечном итоге умерли? **
- Да
- Нет

In [13]:
age_stats = data.groupby('Survived')['Age'].agg(['mean', 'median', 'count']).round(2)

print("Статистика возраста по статусу выживания:")
print(age_stats)
print()

mean_survived = age_stats.loc[1, 'mean']
mean_died = age_stats.loc[0, 'mean']

print(f"Средний возраст выживших: {mean_survived} лет")
print(f"Средний возраст погибших: {mean_died} лет")
print(f"Разница: {round(mean_survived - mean_died, 2)} лет")

if mean_survived > mean_died:
    print("\n ВЕРНО: Средний возраст выживших ВЫШЕ, чем у погибших")
else:
    print("\n НЕВЕРНО: Средний возраст выживших НИЖЕ или РАВЕН возрасту погибших")

Статистика возраста по статусу выживания:
           mean  median  count
Survived
0         30.63    28.0    424
1         28.34    28.0    290

Средний возраст выживших: 28.34 лет
Средний возраст погибших: 30.63 лет
Разница: -2.29 лет

 НЕВЕРНО: Средний возраст выживших НИЖЕ или РАВЕН возрасту погибших

**5. Это правда, что пассажиры моложе 30 лет. выжили чаще, чем те, кому больше 60 лет. Каковы доли выживших людей среди молодых и пожилых людей?**
- 22,7% среди молодежи и 40,6% среди пожилых
- 40,6% среди молодежи и 22,7% среди пожилых
- 35,3% среди молодежи и 27,4% среди пожилых
- 27,4% среди молодежи и 35,3% среди пожилых

In [14]:
young_passengers = data[data['Age'] < 30]
old_passengers = data[data['Age'] > 60]

young_survived = young_passengers[young_passengers['Survived'] == 1]
old_survived = old_passengers[old_passengers['Survived'] == 1]

young_survival_rate = len(young_survived) / len(young_passengers)
old_survival_rate = len(old_survived) / len(old_passengers)

print(f"Доля выживших среди пассажиров моложе 30 лет: {young_survival_rate:.2%}")
print(f"Доля выживших среди пассажиров старше 60 лет: {old_survival_rate:.2%}")

Доля выживших среди пассажиров моложе 30 лет: 40.62%
Доля выживших среди пассажиров старше 60 лет: 22.73%

**6. Правда ли, что женщины выживали чаще мужчин? Каковы доли выживших людей среди мужчин и женщин?**
- 30,2% среди мужчин и 46,2% среди женщин
- 35,7% среди мужчин и 74,2% среди женщин
- 21,1% среди мужчин и 46,2% среди женщин
- 18,9% среди мужчин и 74,2% среди женщин

In [17]:
male_passengers = data[data['Sex'] == 'male']
female_passengers = data[data['Sex'] == 'female']

male_survived = male_passengers[male_passengers['Survived'] == 1]
female_survived = female_passengers[female_passengers['Survived'] == 1]

male_survival_rate = len(male_survived) / len(male_passengers)
female_survival_rate = len(female_survived) / len(female_passengers)

print(f"Доля выживших среди мужчин: {male_survival_rate:.2%} ({len(male_survived)}/{len(male_passengers)})")
print(f"Доля выживших среди женщин: {female_survival_rate:.2%} ({len(female_survived)}/{len(female_passengers)})")

Доля выживших среди мужчин: 18.89% (109/577)
Доля выживших среди женщин: 74.20% (233/314)

**7. Какое имя наиболее популярно среди пассажиров мужского пола?**
- Charles
- Thomas
- William
- John

In [24]:
male_passengers = data[data['Sex'] == 'male'].copy()

def extract_first_name(full_name):
    parts = full_name.split(', ')[1].split('. ')
    if len(parts) > 1:
        return parts[1].split()[0]
    return parts[0].split()[0] if parts[0] else full_name

male_passengers.loc[:, 'FirstName'] = male_passengers['Name'].apply(extract_first_name)

name_counts = male_passengers['FirstName'].value_counts()

most_common_name = name_counts.index[0]

print(most_common_name)

William

**8. Как средний возраст мужчин / женщин зависит от `Pclass`? Выберите все правильные утверждения:**
- В среднем мужчины 1 класса старше 40 лет
- В среднем женщины 1 класса старше 40 лет
- Мужчины всех классов в среднем старше, чем женщины того же класса
- В среднем, пассажиры первого класса старше, чем пассажиры 2-го класса, которые старше, чем пассажиры 3-го класса.

In [25]:
data_clean = data.dropna(subset=['Age'])

age_stats = data_clean.groupby(['Pclass', 'Sex'])['Age'].mean().reset_index()

print("Средний возраст по классам и полу:")
print(age_stats)
print()

result1 = age_stats[(age_stats['Pclass'] == 1) & (age_stats['Sex'] == 'male')]['Age'].values[0] > 40
result2 = age_stats[(age_stats['Pclass'] == 1) & (age_stats['Sex'] == 'female')]['Age'].values[0] > 40

men_older = True
for pclass in [1, 2, 3]:
    male_age = age_stats[(age_stats['Pclass'] == pclass) & (age_stats['Sex'] == 'male')]['Age'].values[0]
    female_age = age_stats[(age_stats['Pclass'] == pclass) & (age_stats['Sex'] == 'female')]['Age'].values[0]
    if male_age <= female_age:
        men_older = False
        break

class_order = True
for sex in ['male', 'female']:
    age1 = age_stats[(age_stats['Pclass'] == 1) & (age_stats['Sex'] == sex)]['Age'].values[0]
    age2 = age_stats[(age_stats['Pclass'] == 2) & (age_stats['Sex'] == sex)]['Age'].values[0]
    age3 = age_stats[(age_stats['Pclass'] == 3) & (age_stats['Sex'] == sex)]['Age'].values[0]
    if not (age1 > age2 > age3):
        class_order = False
        break

print("Верные утверждения:")
if result1:
    print("✓ В среднем мужчины 1 класса старше 40 лет")
if result2:
    print("✓ В среднем женщины 1 класса старше 40 лет")
if men_older:
    print("✓ Мужчины всех классов в среднем старше, чем женщины того же класса")
if class_order:
    print("✓ В среднем, пассажиры первого класса старше, чем пассажиры 2-го класса, которые старше, чем пассажиры 3-го класса")

Средний возраст по классам и полу:
   Pclass     Sex    Age
0       1  female  34.61
1       1    male  41.28
2       2  female  28.72
3       2    male  30.74
4       3  female  21.75
5       3    male  26.51

Верные утверждения:
✓ В среднем мужчины 1 класса старше 40 лет
✓ Мужчины всех классов в среднем старше, чем женщины того же класса
✓ В среднем, пассажиры первого класса старше, чем пассажиры 2-го класса, которые старше, чем пассажиры 3-го класса


Author: [Yury Kashnitsky](https://yorko.github.io). This material is subject to the terms and conditions of the [Creative Commons CC BY-NC-SA 4.0](https://creativecommons.org/licenses/by-nc-sa/4.0/) license. Free use is permitted for any non-commercial purpose.